Static Public Member Functions | List of all members
ACAPI::MEP::v1::Element Class Referencefinal
MEP Element Manager
The Element represents an instantiable ElementBase. More...
#include <MEPElement.hpp>
 Inheritance diagram for ACAPI::MEP::v1::Element:
 Static Public Member Functions
static Result< Element >  | Get (const UniqueID &uniqueId)
Returns an Element.
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
Detailed Description
The Element represents an instantiable ElementBase.
Since
Archicad 27
Member Function Documentation
◆ Get()
 static Result< Element > ACAPI::MEP::v1::Element::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns an Element.
Parameters
uniqueId | The UniqueID of the requested Element.
Returns
If the uniqueId belongs to an Element, returns the object associated to it, otherwise Error.